import { Badge } from "@/components/ui/badge";
import { Button } from "@/components/ui/button";
import { Container } from "@/components/ui/container";

export default function ServicesSection() {
  const tags = [
    { label: "UI/UX", count: 7 },
    { label: "Motion-дизайн", count: 2 },
    { label: "3D", count: 2 },
    { label: "Видео", count: 1 },
    { label: "Логотипы и айдентика", count: 3 },
  ];

  const services = [
    {
      title: "UX/UI для сайтов и приложений",
      id: 7,
      icon: (
        <svg width="71" height="71" viewBox="0 0 71 71" fill="none" xmlns="http://w3.org">
          <path d="M21.6042 68.0443C17.2951 66.1849 13.5469 63.6615 10.3594 60.474C7.17188 57.2865 4.64844 53.5382 2.78906 49.2292C0.929688 44.9201 0 40.316 0 35.4167C0 30.5174 0.929688 25.9132 2.78906 21.6042C4.64844 17.2951 7.17188 13.5469 10.3594 10.3594C13.5469 7.17188 17.2951 4.64844 21.6042 2.78906C25.9132 0.929688 30.5174 0 35.4167 0C40.316 0 44.9201 0.929688 49.2292 2.78906C53.5382 4.64844 57.2865 7.17188 60.474 10.3594C63.6615 13.5469 66.1849 17.2951 68.0443 21.6042C69.9036 25.9132 70.8333 30.5174 70.8333 35.4167C70.8333 40.316 69.9036 44.9201 68.0443 49.2292C66.1849 53.5382 63.6615 57.2865 60.474 60.474C57.2865 63.6615 53.5382 66.1849 49.2292 68.0443C44.9201 69.9036 40.316 70.8333 35.4167 70.8333C30.5174 70.8333 25.9132 69.9036 21.6042 68.0443ZM31.875 63.5729V56.6667C29.9271 56.6667 28.2596 55.9731 26.8724 54.5859C25.4852 53.1988 24.7917 51.5312 24.7917 49.5833V46.0417L7.79167 29.0417C7.61458 30.1042 7.45226 31.1667 7.30469 32.2292C7.15712 33.2917 7.08333 34.3542 7.08333 35.4167C7.08333 42.559 9.42969 48.816 14.1224 54.1875C18.8151 59.559 24.7326 62.6875 31.875 63.5729ZM56.3125 54.5417C58.7326 51.8854 60.5773 48.9193 61.8464 45.6432C63.1155 42.3672 63.75 38.9583 63.75 35.4167C63.75 29.6319 62.1415 24.349 58.9245 19.5677C55.7075 14.7865 51.4132 11.3333 46.0417 9.20833V10.625C46.0417 12.5729 45.3481 14.2405 43.9609 15.6276C42.5738 17.0148 40.9062 17.7083 38.9583 17.7083H31.875V24.7917C31.875 25.7951 31.5356 26.6363 30.8568 27.3151C30.178 27.9939 29.3368 28.3333 28.3333 28.3333H21.25V35.4167H42.5C43.5035 35.4167 44.3446 35.7561 45.0234 36.4349C45.7023 37.1137 46.0417 37.9549 46.0417 38.9583V49.5833H49.5833C51.1181 49.5833 52.5052 50.0408 53.7448 50.9557C54.9844 51.8707 55.8403 53.066 56.3125 54.5417Z" fill="currentColor" />
        </svg>
      )
    },
    {
      title: "Motion-дизайн и 3D",
      id: 2,
      icon: (
        <svg width="71" height="64" viewBox="0 0 71 64" fill="none" xmlns="http://w3.org">
          <path d="M35.4167 63.75L0 21.25L10.625 0H60.2083L70.8333 21.25L35.4167 63.75ZM27.0052 17.7083H43.8281L38.5156 7.08333H32.3177L27.0052 17.7083ZM31.875 48.4323V24.7917H12.2188L31.875 48.4323ZM38.9583 48.4323L58.6146 24.7917H38.9583V48.4323ZM51.7083 17.7083H61.0938L55.7812 7.08333H46.3958L51.7083 17.7083ZM9.73958 17.7083H19.125L24.4375 7.08333H15.0521L9.73958 17.7083Z" fill="currentColor" />
        </svg>
      )
    },
    {
      title: "Логотипы и айдентика",
      id: 3,
      icon: (
        <svg width="78" height="54" viewBox="0 0 78 54" fill="none" xmlns="http://w3.org">
          <path d="M40.6406 41.8802L70.3021 12.2188L65.6979 7.61458L36.0365 37.276L40.6406 41.8802ZM17.5312 49.5833C11.6285 49.2882 7.2309 48.0486 4.33854 45.8646C1.44618 43.6806 0 40.5226 0 36.3906C0 32.5538 1.57899 29.4401 4.73698 27.0495C7.89497 24.6589 12.2778 23.2274 17.8854 22.7552C20.1875 22.5781 21.9141 22.2092 23.0651 21.6484C24.2161 21.0877 24.7917 20.3056 24.7917 19.3021C24.7917 17.7674 23.921 16.6163 22.1797 15.849C20.4384 15.0816 17.5608 14.5208 13.5469 14.1667L14.1667 7.08333C20.2465 7.55556 24.7179 8.78038 27.5807 10.7578C30.4436 12.7352 31.875 15.5833 31.875 19.3021C31.875 22.4306 30.7387 24.8802 28.4661 26.651C26.1936 28.4219 22.8438 29.4844 18.4167 29.8385C14.6389 30.1337 11.8056 30.8273 9.91667 31.9193C8.02778 33.0113 7.08333 34.5017 7.08333 36.3906C7.08333 38.4566 7.90972 39.9471 9.5625 40.862C11.2153 41.7769 13.9896 42.3229 17.8854 42.5L17.5312 49.5833ZM42.3229 50.2031L27.7135 35.5938L61.5365 1.77083C62.717 0.590278 64.1189 0 65.7422 0C67.3654 0 68.7674 0.590278 69.9479 1.77083L76.1458 7.96875C77.3264 9.14931 77.9167 10.5512 77.9167 12.1745C77.9167 13.7977 77.3264 15.1997 76.1458 16.3802L42.3229 50.2031ZM28.2448 53.125C27.2413 53.3611 26.3559 53.0955 25.5885 52.3281C24.8212 51.5608 24.5556 50.6754 24.7917 49.6719L27.7135 35.5938L42.3229 50.2031L28.2448 53.125Z" fill="currentColor" />
        </svg>
      )
    },
  ];

  return (
    <Container className="items-center grid grid-cols-1 md:grid-cols-[500px_1fr] gap-[40px] py-16 sm:h-[450px]">
      <div>
        <h2 className="text-display-2">
          Дизайн любого уровня <br /> сложности
        </h2>

        <div className="mt-4 flex flex-wrap gap-2">
          {tags.map((tag, key) => (
            <Button
              key={key}
            >
              <span className="text-[13px] text-gray-400 group-hover/tag:text-white transition-colors">{tag.label}</span>
              <Badge>{tag.count}</Badge>
            </Button>
          ))}
        </div>
      </div>

      <div className="grid grid-cols-1 sm:grid-cols-3 gap-3 sm:w-full">
        {services.map((item) => (
          <div
            key={item.id}
            className="relative w-full h-[150px] md:h-[322px] bg-(--card) rounded-[1.5rem] md:rounded-[2rem] p-6 md:p-8 flex flex-col items-center justify-center text-center 
                   border border-white/5 transition-all duration-300 group cursor-pointer
                   hover:bg-[#161616] hover:border-[#4A77FF] hover:shadow-[0_0_25px_rgba(74,119,255,0.15)]"
          >
            <div className="absolute top-4 right-4 md:top-6 md:right-6 text-[10px] font-mono w-6 h-6 rounded-full flex items-center justify-center transition-all duration-300
                        text-[#4A77FF] bg-[#4A77FF]/10 
                        group-hover:bg-[#4A77FF] group-hover:text-white">
              {item.id}
            </div>

            <div className="mb-3 md:mb-8 transition-all duration-500 text-[#555] group-hover:text-[#4A77FF] scale-75 md:scale-100">
              {item.icon}
            </div>

            <p className="text-[14px] md:text-[15px] font-medium leading-snug px-2 transition-colors duration-300
                      text-gray-400 group-hover:text-white">
              {item.title}
            </p>
          </div>
        ))}
      </div>
    </Container>
  );
}